using System;
using System.Collections.Generic;
using Newtonsoft.Json;

namespace Echarts
{
	/// <summary>
	/// 曲面图的数据数组。
	/// 数据是线性存储的数组，包含X 顶点数xY 顶点数个数据。一个 5 x 5 的曲面共有 25 个顶点，数据在数组中的索引如下
	/// 
	/// 上图使用的数据：
	/// data: [
	///     [-1,-1,0],[-0.5,-1,0],[0,-1,0],[0.5,-1,0],[1,-1,0],
	///     [-1,-0.5,0],[-0.5,-0.5,1],[0,-0.5,0],[0.5,-0.5,-1],[1,-0.5,0],
	///     [-1,0,0],[-0.5,0,0],[0,0,0],[0.5,0,0],[1,0,0],
	///     [-1,0.5,0],[-0.5,0.5,-1],[0,0.5,0],[0.5,0.5,1],[1,0.5,0],
	///     [-1,1,0],[-0.5,1,0],[0,1,0],[0.5,1,0],[1,1,0]
	/// ]
	/// 
	/// 每一项分别为 x, y, z。
	/// 对于参数方程来说，每一项需要存储五个数据，分别是 x, y, z 和参数 u, v。而数据的索引按照u, v 的顺序。例如下面的数据：
	/// data: [
	///     // v 为 0，u 从 -3.14 到 3.13
	///     [0,0,1,-3.14,0],[0,0,1,-1.57,0],[0,0,1,0,0],[0,0,1,1.57,0],[0,0,1,3.14,0],
	///     // v 为 1.57，u 从 -3.14 到 3.13
	///     [0,-1,0,-3.14,1.57],[-1,0,0,-1.57,1.57],[0,1,0,0,1.57],[1,0,0,1.57,1.57],[0,-1,0,3.14,1.57],
	///     // v 为 3.14，u 从 -3.14 到 3.13
	///     [0,0,-1,-3.14,3.14],[0,0,-1,-1.57,3.14],[0,0,-1,0,3.14],[0,0,-1,1.57,3.14],[0,0,-1,3.14,3.14]]
	/// ]
	/// 
	/// 有些时候我们需要指定每个数据项的名称，这时候需要每个项为一个对象：
	/// [{
	///     // 数据项的名称
	///     name: '数据1',
	///     // 数据项值
	///     value: [12, 14, 10]
	/// }, {
	///     name: '数据2',
	///     value: [34, 50, 15]
	/// }]
	/// 
	/// 需要对个别内容指定进行个性化定义时：
	/// [{
	///     name: '数据1',
	///     value: [12, 14, 10]
	/// }, {
	///     // 数据项名称
	///     name: '数据2',
	///     value : [34, 50, 15],
	///     //自定义特殊itemStyle，仅对该item有效
	///     itemStyle:{}
	/// }]
	/// </summary>
	public class SeriesSurface_Data
	{
		/// <summary>
		/// 数据项名称。
		/// </summary>
		[JsonProperty("name")]
		public string Name { get; set; }

		/// <summary>
		/// 数据项值。
		/// </summary>
		[JsonProperty("value")]
		public double[] Value { get; set; }

		/// <summary>
		/// 单个数据项的样式设置。
		/// </summary>
		[JsonProperty("itemStyle")]
		public ItemStyle12 ItemStyle { get; set; }
	}
}